
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Страна = Параметры.Страна;
	Регион = Параметры.Регион;
	Город = Параметры.Город;
	Улица = Параметры.Улица;
	Дом = Параметры.Дом;
	Индекс = Параметры.Индекс;
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Страна", Страна);
	ПараметрыФормы.Вставить("Регион", Регион);
	ПараметрыФормы.Вставить("Город", Город);
	ПараметрыФормы.Вставить("Улица", Улица);
	ПараметрыФормы.Вставить("Дом", Дом);
	ПараметрыФормы.Вставить("Индекс", Индекс);
	Закрыть(ПараметрыФормы);
КонецПроцедуры
