
&НаКлиенте
Процедура ОткрытьОтчет(Команда)

	Перем КлючВарианта;
	Перем ИмяОтчета;
	СтрокиДляОбработки = Элементы.Список.ПолучитьСтрокиДляОбработки();
	Если СтрокиДляОбработки.Количество() = 1 Тогда
		
		ПолучитьКлючВариантаИИмяОтчета(СтрокиДляОбработки[0], КлючВарианта, ИмяОтчета);
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(СтрокиДляОбработки[0]);

		Если НЕ ЗначениеЗаполнено(ИмяОтчета) Тогда
			Возврат;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(КлючВарианта) Тогда
			Возврат;
		КонецЕсли;

		Форма = ПолучитьФорму(ИмяОтчета + ".Форма", , Новый УникальныйИдентификатор);
		Форма.УстановитьТекущийВариант(КлючВарианта);
		Форма.Открыть();
	Иначе
		Сообщить(НСтр("ru = 'Действие недоступно для несколько строк списка'", "ru"));
	КонецЕсли;
	
КонецПроцедуры                

&НаСервере
Процедура ПолучитьКлючВариантаИИмяОтчета(ХранилищеВариантовОтчетовСсылка, КлючВарианта, ИмяОтчета)
	
	Если ТипЗнч(ХранилищеВариантовОтчетовСсылка) = Тип("СправочникСсылка.ХранилищеВариантовОтчетов") Тогда
		КлючВарианта = ХранилищеВариантовОтчетовСсылка.Код;
		ИмяОтчета = ХранилищеВариантовОтчетовСсылка.КлючОбъекта;
	Иначе
		Сообщить(НСтр("ru = 'Действие недоступно для строки группировки списка'", "ru"));
	КонецЕсли;

КонецПроцедуры